lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_vpr.cpp
#include "nrf54l15_vpr.h"

#include <string.h>

#include "vpr_cs_controller_stub_firmware.h"
#include "vpr_cs_transport_stub_firmware.h"

namespace xiao_nrf54l15 {
namespace {

constexpr uint32_t kCtrlApIntRxReady = (1UL << 0U);
constexpr uint32_t kCtrlApIntTxDone = (1UL << 1U);
constexpr uint32_t kCpuSystemCacheBase = 0xE0082000UL;
constexpr uint32_t kMemconfSecureBase = 0x500CF000UL;
constexpr uint32_t kMpc00SecureBase = 0x50041000UL;
constexpr uint32_t kSpu00SecureBase = 0x50040000UL;
constexpr uint32_t kVprSecureBase = 0x5004C000UL;
constexpr uint32_t kVprNonSecureBase = 0x4004C000UL;
constexpr uint8_t kVprMinTrigger = 16U;
constexpr uint8_t kVprMaxTrigger = 22U;
constexpr uint8_t kTransportTask = NRF54L15_VPR_TRANSPORT_HOST_TO_VPR_TASK;
constexpr uint8_t kTransportEvent = NRF54L15_VPR_TRANSPORT_VPR_TO_HOST_EVENT;
constexpr uint32_t kVprNordicCtrlOffset = VPRCSR_NORDIC_VPRNORDICCTRL;
constexpr uint32_t kVprNordicCacheCtrlOffset = VPRCSR_NORDIC_CACHE_CTRL;
constexpr uint32_t kVprContextRestorePowerIndex = 1U;
constexpr uint32_t kVprContextRestoreRetMask = MEMCONF_POWER_RET_MEM0_Msk;
constexpr uint32_t kVprContextRestoreRet2PowerIndex = 0U;
constexpr uint32_t kVprContextRestoreRet2Mask = MEMCONF_POWER_RET2_MEM7_Msk;
constexpr uint32_t kAddressSlavePos = 12U;
constexpr uint32_t kAddressSlaveMask = (0x3FUL << kAddressSlavePos);
constexpr uint32_t kMpcOverrideGranularity = 0x1000UL;
constexpr uint8_t kMpcTransportHostOverrideIndex = 0U;
constexpr uint8_t kMpcTransportVprOverrideIndex = 1U;

bool g_vprSecureAccessEnabled = false;

inline void dataSyncBarrier() {
  __DMB();
  __DSB();
}

inline void fullSyncBarrier() {
  __DMB();
  __DSB();
  __ISB();
}

inline volatile uint8_t* vprImageBase() {
  return reinterpret_cast<volatile uint8_t*>(static_cast<uintptr_t>(NRF54L15_VPR_IMAGE_BASE));
}

inline volatile uint8_t* vprSavedContextBase() {
  return reinterpret_cast<volatile uint8_t*>(
      static_cast<uintptr_t>(NRF54L15_VPR_CONTEXT_SAVE_BASE));
}

inline uint32_t currentVprBase() {
  return g_vprSecureAccessEnabled ? kVprSecureBase : kVprNonSecureBase;
}

inline bool isAlignedVprCsrOffset(uint32_t offset) {
  return (offset & 0x3U) == 0U;
}

inline void writeAlignedVprCsr(uint32_t offset, uint32_t value) {
  if (!isAlignedVprCsrOffset(offset)) {
    return;
  }
  nrf54l15::reg32(currentVprBase() + offset) = value;
}

inline uint32_t readAlignedVprCsr(uint32_t offset) {
  if (!isAlignedVprCsrOffset(offset)) {
    return 0U;
  }
  return nrf54l15::reg32(currentVprBase() + offset);
}

inline NRF_CACHE_Type* cpuSystemCache() {
  return reinterpret_cast<NRF_CACHE_Type*>(static_cast<uintptr_t>(kCpuSystemCacheBase));
}

inline NRF_MEMCONF_Type* memconf() {
  return reinterpret_cast<NRF_MEMCONF_Type*>(static_cast<uintptr_t>(kMemconfSecureBase));
}

inline void invalidateCpuSystemCache() {
  NRF_CACHE_Type* cache = cpuSystemCache();
  cache->TASKS_INVALIDATECACHE = CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Trigger;
  dataSyncBarrier();
  uint32_t spinLimit = 100000U;
  while (((cache->STATUS & CACHE_STATUS_READY_Msk) == CACHE_STATUS_READY_Busy) &&
         (spinLimit-- > 0U)) {
    __NOP();
  }
  fullSyncBarrier();
}

inline NRF_SPU_Type* spu00() {
  return reinterpret_cast<NRF_SPU_Type*>(static_cast<uintptr_t>(kSpu00SecureBase));
}

inline NRF_MPC_Type* mpc00() {
  return reinterpret_cast<NRF_MPC_Type*>(static_cast<uintptr_t>(kMpc00SecureBase));
}

inline uint8_t vprSlaveIndex() {
  return static_cast<uint8_t>((kVprSecureBase & kAddressSlaveMask) >> kAddressSlavePos);
}

inline uint32_t vprPermValue() {
  return spu00()->PERIPH[vprSlaveIndex()].PERM;
}

inline bool configureSecureVprPeripheralAccess() {
  NRF_SPU_Type* periphSpu = spu00();
  const uint8_t index = vprSlaveIndex();
  uint32_t perm = periphSpu->PERIPH[index].PERM;
  const uint32_t secureMapping =
      (perm & SPU_PERIPH_PERM_SECUREMAPPING_Msk) >> SPU_PERIPH_PERM_SECUREMAPPING_Pos;
  if (secureMapping == SPU_PERIPH_PERM_SECUREMAPPING_NonSecure) {
    g_vprSecureAccessEnabled = false;
    return false;
  }

  if (secureMapping == SPU_PERIPH_PERM_SECUREMAPPING_UserSelectable ||
      secureMapping == SPU_PERIPH_PERM_SECUREMAPPING_Split) {
    perm = (perm & ~SPU_PERIPH_PERM_SECATTR_Msk) |
           (SPU_PERIPH_PERM_SECATTR_Secure << SPU_PERIPH_PERM_SECATTR_Pos);

    const uint32_t dmaCapability =
        (perm & SPU_PERIPH_PERM_DMA_Msk) >> SPU_PERIPH_PERM_DMA_Pos;
    if (dmaCapability == SPU_PERIPH_PERM_DMA_SeparateAttribute) {
      perm = (perm & ~SPU_PERIPH_PERM_DMASEC_Msk) |
             (SPU_PERIPH_PERM_DMASEC_Secure << SPU_PERIPH_PERM_DMASEC_Pos);
    }

    periphSpu->PERIPH[index].PERM = perm;
    dataSyncBarrier();
    perm = periphSpu->PERIPH[index].PERM;
  }

  g_vprSecureAccessEnabled =
      (((perm & SPU_PERIPH_PERM_SECATTR_Msk) >> SPU_PERIPH_PERM_SECATTR_Pos) ==
       SPU_PERIPH_PERM_SECATTR_Secure);
  fullSyncBarrier();
  return g_vprSecureAccessEnabled;
}

inline void clearMpcMemAccErrInternal() {
  NRF_MPC_Type* mpc = mpc00();
  mpc->EVENTS_MEMACCERR = 0U;
  dataSyncBarrier();
}

inline void configureMpcOverrideRegion(uint8_t index, uint32_t address) {
  if (index > 4U) {
    return;
  }
  NRF_MPC_Type* mpc = mpc00();
  volatile NRF_MPC_OVERRIDE_Type* region = &mpc->OVERRIDE[index];
  const uint32_t alignedAddress = address & ~(kMpcOverrideGranularity - 1U);
  region->CONFIG = 0U;
  region->STARTADDR = alignedAddress;
  region->ENDADDR = alignedAddress;
  region->PERM = (MPC_OVERRIDE_PERM_READ_Allowed << MPC_OVERRIDE_PERM_READ_Pos) |
                 (MPC_OVERRIDE_PERM_WRITE_Allowed << MPC_OVERRIDE_PERM_WRITE_Pos) |
                 (MPC_OVERRIDE_PERM_SECATTR_NonSecure << MPC_OVERRIDE_PERM_SECATTR_Pos);
  region->PERMMASK =
      (MPC_OVERRIDE_PERMMASK_READ_UnMasked << MPC_OVERRIDE_PERMMASK_READ_Pos) |
      (MPC_OVERRIDE_PERMMASK_WRITE_UnMasked << MPC_OVERRIDE_PERMMASK_WRITE_Pos) |
      (MPC_OVERRIDE_PERMMASK_SECATTR_UnMasked << MPC_OVERRIDE_PERMMASK_SECATTR_Pos);
  region->CONFIG = (MPC_OVERRIDE_CONFIG_ENABLE_Enabled << MPC_OVERRIDE_CONFIG_ENABLE_Pos);
}

inline void configureTransportMpcWindows() {
  clearMpcMemAccErrInternal();
  configureMpcOverrideRegion(kMpcTransportHostOverrideIndex,
                             NRF54L15_VPR_TRANSPORT_HOST_BASE);
  configureMpcOverrideRegion(kMpcTransportVprOverrideIndex,
                             NRF54L15_VPR_TRANSPORT_VPR_BASE);
  fullSyncBarrier();
}

