lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_vpr.cpp
inline void shortSpinDelay(uint32_t cycles) {
  while (cycles-- > 0U) {
    __NOP();
  }
}

inline bool waitForVprRunning(uint32_t spinLimit = 4096U) {
  NRF_VPR_Type* const vpr =
      reinterpret_cast<NRF_VPR_Type*>(static_cast<uintptr_t>(currentVprBase()));
  while (spinLimit-- > 0U) {
    if ((vpr->CPURUN & VPR_CPURUN_EN_Msk) != 0U) {
      return true;
    }
    shortSpinDelay(8U);
  }
  return false;
}

}  // namespace

NRF_CTRLAPPERI_Type* CtrlApMailbox::regs() {
  return reinterpret_cast<NRF_CTRLAPPERI_Type*>(static_cast<uintptr_t>(nrf54l15::CTRLAPPERI_BASE));
}

void CtrlApMailbox::clearEvents() {
  NRF_CTRLAPPERI_Type* periph = regs();
  periph->EVENTS_RXREADY = 0U;
  periph->EVENTS_TXDONE = 0U;
  dataSyncBarrier();
}

bool CtrlApMailbox::pollRxReady(bool clearEvent) {
  NRF_CTRLAPPERI_Type* periph = regs();
  if (periph->EVENTS_RXREADY == 0U) {
    return false;
  }
  if (clearEvent) {
    periph->EVENTS_RXREADY = 0U;
    dataSyncBarrier();
  }
  return true;
}

bool CtrlApMailbox::pollTxDone(bool clearEvent) {
  NRF_CTRLAPPERI_Type* periph = regs();
  if (periph->EVENTS_TXDONE == 0U) {
    return false;
  }
  if (clearEvent) {
    periph->EVENTS_TXDONE = 0U;
    dataSyncBarrier();
  }
  return true;
}

bool CtrlApMailbox::rxPending() {
  return (regs()->MAILBOX.RXSTATUS & CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Msk) != 0U;
}

bool CtrlApMailbox::txPending() {
  return (regs()->MAILBOX.TXSTATUS & CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Msk) != 0U;
}

bool CtrlApMailbox::read(uint32_t* value) {
  if (value == nullptr || !rxPending()) {
    return false;
  }
  *value = regs()->MAILBOX.RXDATA;
  dataSyncBarrier();
  return true;
}

bool CtrlApMailbox::write(uint32_t value) {
  if (txPending()) {
    return false;
  }
  regs()->MAILBOX.TXDATA = value;
  dataSyncBarrier();
  return true;
}

void CtrlApMailbox::enableInterrupts(bool rxReady, bool txDone) {
  NRF_CTRLAPPERI_Type* periph = regs();
  const uint32_t mask = (rxReady ? kCtrlApIntRxReady : 0U) | (txDone ? kCtrlApIntTxDone : 0U);
  periph->INTENCLR = kCtrlApIntRxReady | kCtrlApIntTxDone;
  if (mask != 0U) {
    periph->INTENSET = mask;
  }
  dataSyncBarrier();
}

NRF_VPR_Type* VprControl::regs() {
  return reinterpret_cast<NRF_VPR_Type*>(static_cast<uintptr_t>(currentVprBase()));
}

bool VprControl::validTriggerIndex(uint8_t index) {
  return index >= kVprMinTrigger && index <= kVprMaxTrigger;
}

bool VprControl::setInitPc(uint32_t address) {
  if (address < NRF54L15_VPR_IMAGE_BASE ||
      address >= (NRF54L15_VPR_IMAGE_BASE + NRF54L15_VPR_IMAGE_SIZE)) {
    return false;
  }
  regs()->INITPC = address;
  fullSyncBarrier();
  return true;
}

uint32_t VprControl::initPc() { return regs()->INITPC; }

void VprControl::prepareForLaunch() {
  (void)configureSecureVprPeripheralAccess();
  stop();
  fullSyncBarrier();
}

void VprControl::run() {
  regs()->CPURUN = VPR_CPURUN_EN_Running;
  fullSyncBarrier();
}

bool VprControl::start(uint32_t address) {
  if (!configureSecureVprPeripheralAccess()) {
    return false;
  }
  stop();
  fullSyncBarrier();
  clearDebugHaltState();
  if (!hartResetPulse()) {
    return false;
  }
  enableRtPeripherals();
  if (!setInitPc(address)) {
    return false;
  }
  run();
  return waitForVprRunning();
}

void VprControl::stop() {
  regs()->CPURUN = VPR_CPURUN_EN_Stopped;
  fullSyncBarrier();
}

bool VprControl::isRunning() {
  return (regs()->CPURUN & VPR_CPURUN_EN_Msk) != 0U;
}

bool VprControl::secureAccessEnabled() { return g_vprSecureAccessEnabled; }

uint32_t VprControl::spuPerm() { return vprPermValue(); }

void VprControl::enableRtPeripherals() {
  // Only the aligned control CSR is touched from CPUAPP. Unaligned FLPR CSR
  // numbers such as VPRNORDICSLEEPCTRL are not safe to access this way.
  const uint32_t value =
      (VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Enabled
       << VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos) |
      VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Msk;
  writeAlignedVprCsr(kVprNordicCtrlOffset, value);
  fullSyncBarrier();
}

void VprControl::configureDataAccessNonCacheable() {
  fullSyncBarrier();
}

void VprControl::clearCache() {
  writeAlignedVprCsr(kVprNordicCacheCtrlOffset,
                     VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Msk |
                         VPRCSR_NORDIC_CACHE_CTRL_CACHECLR_Msk);
  fullSyncBarrier();
  writeAlignedVprCsr(kVprNordicCacheCtrlOffset, VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Msk);
  invalidateCpuSystemCache();
  fullSyncBarrier();
}

void VprControl::clearBufferedSignals() {
  for (uint8_t index = kVprMinTrigger; index <= kVprMaxTrigger; ++index) {
    regs()->EVENTS_TRIGGERED[index] = 0U;
  }
  dataSyncBarrier();
}

void VprControl::clearDebugHaltState() {
  regs()->DEBUGIF.DMCONTROL =
      (VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos) |
      (VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Clear << VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Pos) |
      (VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Clear
       << VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Pos) |
      (VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Resumed << VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Pos);
  fullSyncBarrier();
  regs()->DEBUGIF.DMCONTROL =
      (VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos);
  fullSyncBarrier();
}

uint32_t VprControl::debugStatus() { return regs()->DEBUGIF.DMSTATUS; }

uint32_t VprControl::haltSummary0() { return regs()->DEBUGIF.HALTSUM0; }

uint32_t VprControl::haltSummary1() { return regs()->DEBUGIF.HALTSUM1; }

uint32_t VprControl::rawNordicAxCache() { return 0U; }

uint32_t VprControl::rawNordicTasks() { return 0U; }

uint32_t VprControl::rawNordicEvents() { return 0U; }

uint32_t VprControl::rawNordicEventStatus() { return 0U; }

uint32_t VprControl::rawSleepControl() { return 0U; }

uint32_t VprControl::rawNordicCacheCtrl() { return readAlignedVprCsr(kVprNordicCacheCtrlOffset); }

uint32_t VprControl::rawMpcMemAccErrEvent() { return mpc00()->EVENTS_MEMACCERR; }

uint32_t VprControl::rawMpcMemAccErrAddress() { return mpc00()->MEMACCERR.ADDRESS; }

