lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_vpr.cpp
uint32_t VprControl::rawMpcMemAccErrInfo() { return mpc00()->MEMACCERR.INFO; }

void VprControl::clearMpcMemAccErr() { clearMpcMemAccErrInternal(); }

bool VprControl::configureSleepControl(VprSleepState state,
                                       bool returnToSleep,
                                       bool stackOnSleep) {
  (void)state;
  (void)returnToSleep;
  (void)stackOnSleep;
  return false;
}

VprSleepState VprControl::sleepState() {
  return VprSleepState::kReset;
}

bool VprControl::returnToSleepEnabled() { return false; }

bool VprControl::stackOnSleepEnabled() { return false; }

bool VprControl::enableContextRestore(bool enable) {
  NRF_MEMCONF_Type* cfg = memconf();
  if (enable) {
    cfg->POWER[kVprContextRestorePowerIndex].RET |= kVprContextRestoreRetMask;
    cfg->POWER[kVprContextRestoreRet2PowerIndex].RET2 |= kVprContextRestoreRet2Mask;
  } else {
    cfg->POWER[kVprContextRestorePowerIndex].RET &= ~kVprContextRestoreRetMask;
    cfg->POWER[kVprContextRestoreRet2PowerIndex].RET2 &= ~kVprContextRestoreRet2Mask;
  }
  fullSyncBarrier();
  return contextRestoreEnabled() == enable;
}

bool VprControl::contextRestoreEnabled() {
  return ((rawMemconfPower1Ret() & kVprContextRestoreRetMask) != 0U) &&
         ((rawMemconfPower0Ret2() & kVprContextRestoreRet2Mask) != 0U);
}

bool VprControl::hartResetPulse(uint32_t spinLimit) {
  if (!configureSecureVprPeripheralAccess()) {
    return false;
  }

  regs()->DEBUGIF.DMCONTROL =
      (VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos) |
      (VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Clear
       << VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Pos) |
      (VPR_DEBUGIF_DMCONTROL_NDMRESET_Active << VPR_DEBUGIF_DMCONTROL_NDMRESET_Pos);
  fullSyncBarrier();
  shortSpinDelay((spinLimit > 8192U) ? 8192U : spinLimit);

  regs()->DEBUGIF.DMCONTROL =
      (VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos) |
      (VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Clear
       << VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Pos) |
      (VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Resumed << VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Pos);
  fullSyncBarrier();
  shortSpinDelay((spinLimit > 16384U) ? 16384U : spinLimit);

  regs()->DEBUGIF.DMCONTROL =
      (VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos) |
      (VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Clear << VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Pos);
  fullSyncBarrier();
  regs()->DEBUGIF.DMCONTROL =
      (VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos);
  fullSyncBarrier();
  shortSpinDelay((spinLimit > 4096U) ? 4096U : spinLimit);
  return true;
}

bool VprControl::restartAfterHibernateReset() {
  if (!contextRestoreEnabled() || !configureSecureVprPeripheralAccess()) {
    return false;
  }
  stop();
  fullSyncBarrier();
  clearDebugHaltState();
  if (!hartResetPulse()) {
    return false;
  }
  clearCache();
  invalidateCpuSystemCache();
  enableRtPeripherals();
  if (!setInitPc(NRF54L15_VPR_IMAGE_BASE)) {
    return false;
  }
  run();
  return waitForVprRunning(32768U);
}

bool VprControl::resumeRetainedContext() { return restartAfterHibernateReset(); }

uint32_t VprControl::rawMemconfPower0Ret2() {
  return memconf()->POWER[kVprContextRestoreRet2PowerIndex].RET2;
}

uint32_t VprControl::rawMemconfPower1Ret() {
  return memconf()->POWER[kVprContextRestorePowerIndex].RET;
}

uint32_t VprControl::savedContextAddress() { return NRF54L15_VPR_CONTEXT_SAVE_BASE; }

uint32_t VprControl::savedContextSize() { return NRF54L15_VPR_CONTEXT_SAVE_SIZE; }

bool VprControl::clearSavedContext() {
  volatile uint8_t* base = vprSavedContextBase();
  for (size_t i = 0U; i < NRF54L15_VPR_CONTEXT_SAVE_SIZE; ++i) {
    base[i] = 0U;
  }
  fullSyncBarrier();
  invalidateCpuSystemCache();
  return true;
}

bool VprControl::readSavedContext(void* buffer, size_t len, size_t offset) {
  if (buffer == nullptr || len == 0U ||
      offset >= NRF54L15_VPR_CONTEXT_SAVE_SIZE ||
      len > (NRF54L15_VPR_CONTEXT_SAVE_SIZE - offset)) {
    return false;
  }
  invalidateCpuSystemCache();
  volatile uint8_t* base = vprSavedContextBase() + offset;
  uint8_t* out = reinterpret_cast<uint8_t*>(buffer);
  for (size_t i = 0U; i < len; ++i) {
    out[i] = base[i];
  }
  return true;
}

bool VprControl::triggerTask(uint8_t index) {
  if (!validTriggerIndex(index)) {
    return false;
  }
  regs()->TASKS_TRIGGER[index] = VPR_TASKS_TRIGGER_TASKS_TRIGGER_Trigger;
  dataSyncBarrier();
  return true;
}

bool VprControl::pollEvent(uint8_t index, bool clearEvent) {
  if (!validTriggerIndex(index) || regs()->EVENTS_TRIGGERED[index] == 0U) {
    return false;
  }
  if (clearEvent) {
    regs()->EVENTS_TRIGGERED[index] = 0U;
    dataSyncBarrier();
  }
  return true;
}

bool VprControl::clearEvent(uint8_t index) {
  if (!validTriggerIndex(index)) {
    return false;
  }
  regs()->EVENTS_TRIGGERED[index] = 0U;
  dataSyncBarrier();
  return true;
}

bool VprControl::enableEventInterrupt(uint8_t index, bool enable) {
  if (!validTriggerIndex(index)) {
    return false;
  }
  const uint32_t mask = (1UL << index);
  if (enable) {
    regs()->INTENSET = mask;
  } else {
    regs()->INTENCLR = mask;
  }
  dataSyncBarrier();
  return true;
}

VprSharedTransportStream::VprSharedTransportStream() : rxBuffer_{0}, rxLen_(0U), rxIndex_(0U) {}

volatile Nrf54l15VprTransportHostShared* VprSharedTransportStream::hostShared() const {
  return nrf54l15_vpr_transport_host_shared();
}

volatile Nrf54l15VprTransportVprShared* VprSharedTransportStream::vprShared() const {
  return nrf54l15_vpr_transport_vpr_shared();
}

bool VprSharedTransportStream::resetSharedState(bool clearScripts) {
  volatile Nrf54l15VprTransportHostShared* host = hostShared();
  volatile Nrf54l15VprTransportVprShared* vpr = vprShared();
  const size_t hostPrefixLen = offsetof(Nrf54l15VprTransportHostShared, scripts);
  memset(reinterpret_cast<void*>(const_cast<Nrf54l15VprTransportHostShared*>(host)), 0,
         hostPrefixLen);
  if (clearScripts) {
    memset(reinterpret_cast<void*>(&const_cast<Nrf54l15VprTransportHostShared*>(host)->scripts[0]),
           0, sizeof(host->scripts));
  }
  memset(reinterpret_cast<void*>(const_cast<Nrf54l15VprTransportVprShared*>(vpr)), 0,
         sizeof(*vpr));
  host->magic = NRF54L15_VPR_TRANSPORT_MAGIC;
  host->version = NRF54L15_VPR_TRANSPORT_VERSION;
  vpr->magic = NRF54L15_VPR_TRANSPORT_MAGIC;
  vpr->version = NRF54L15_VPR_TRANSPORT_VERSION;
  vpr->status = NRF54L15_VPR_TRANSPORT_STATUS_STOPPED;
  dataSyncBarrier();
  rxLen_ = 0U;
  rxIndex_ = 0U;
  return true;
}

bool VprSharedTransportStream::clearScripts() {
  volatile Nrf54l15VprTransportHostShared* host = hostShared();
  memset(reinterpret_cast<void*>(&const_cast<Nrf54l15VprTransportHostShared*>(host)->scripts[0]), 0,
         sizeof(host->scripts));
  host->scriptCount = 0U;
  dataSyncBarrier();
  return true;
}

