lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_vpr.cpp
bool VprSharedTransportStream::addScriptResponse(uint16_t opcode,
                                                 const uint8_t* response,
                                                 size_t len) {
  if (response == nullptr || len == 0U || len > NRF54L15_VPR_TRANSPORT_MAX_SCRIPT_RESPONSE) {
    return false;
  }
  volatile Nrf54l15VprTransportHostShared* host = hostShared();
  if (host->scriptCount >= NRF54L15_VPR_TRANSPORT_MAX_SCRIPT_COUNT) {
    return false;
  }
  Nrf54l15VprTransportScript* script =
      &const_cast<Nrf54l15VprTransportHostShared*>(host)->scripts[host->scriptCount];
  memset(script, 0, sizeof(*script));
  script->opcode = opcode;
  script->responseLen = static_cast<uint16_t>(len);
  memcpy(script->response, response, len);
  ++host->scriptCount;
  dataSyncBarrier();
  return true;
}

bool VprSharedTransportStream::loadFirmware(const uint8_t* image, size_t len) {
  if (image == nullptr || len == 0U || len > NRF54L15_VPR_IMAGE_SIZE) {
    return false;
  }
  VprControl::stop();
  memset(reinterpret_cast<void*>(const_cast<uint8_t*>(vprImageBase())), 0, NRF54L15_VPR_IMAGE_SIZE);
  memcpy(reinterpret_cast<void*>(const_cast<uint8_t*>(vprImageBase())), image, len);
  fullSyncBarrier();
  invalidateCpuSystemCache();
  return true;
}

bool VprSharedTransportStream::bootLoadedFirmware() {
  configureTransportMpcWindows();
  vprShared()->status = NRF54L15_VPR_TRANSPORT_STATUS_BOOTING;
  dataSyncBarrier();
  if (!VprControl::start(NRF54L15_VPR_IMAGE_BASE)) {
    return false;
  }
  return true;
}

bool VprSharedTransportStream::loadFirmwareAndStart(const uint8_t* image, size_t len) {
  if (!loadFirmware(image, len) || !bootLoadedFirmware()) {
    return false;
  }
  return waitReady();
}

bool VprSharedTransportStream::loadDefaultCsTransportStubImage() {
  return loadFirmware(kVprCsTransportStubFirmware, kVprCsTransportStubFirmwareSize);
}

bool VprSharedTransportStream::loadDefaultCsTransportStub() {
  return loadDefaultCsTransportStubImage() && bootLoadedFirmware() && waitReady();
}

bool VprSharedTransportStream::loadDefaultCsControllerStubImage() {
  return loadFirmware(kVprCsControllerStubFirmware, kVprCsControllerStubFirmwareSize);
}

bool VprSharedTransportStream::loadDefaultCsControllerStub() {
  return loadDefaultCsControllerStubImage() && bootLoadedFirmware() && waitReady();
}

bool VprSharedTransportStream::restartLoadedFirmware(bool clearScripts, uint32_t spinLimit) {
  stop();
  delay(10);
  VprControl::clearBufferedSignals();
  VprControl::clearDebugHaltState();
  VprControl::clearCache();
  invalidateCpuSystemCache();
  if (!resetSharedState(clearScripts) || !bootLoadedFirmware()) {
    return false;
  }
  return waitReady(spinLimit);
}

bool VprSharedTransportStream::resumeRetainedService(uint32_t spinLimit) {
  return restartAfterHibernateReset(spinLimit);
}

bool VprSharedTransportStream::retainedHibernateStatePending() const {
  return hostShared()->hibernateCookie == NRF54L15_VPR_TRANSPORT_HIBERNATE_COOKIE;
}

void VprSharedTransportStream::clearRetainedHibernateState() {
  volatile Nrf54l15VprTransportHostShared* host = hostShared();
  host->hibernateCookie = 0U;
  host->hibernateFlags = 0U;
  host->retainedTickerPeriodTicks = 0U;
  host->retainedTickerStep = 0U;
  host->retainedTickerAccum = 0U;
  host->retainedTickerCount = 0U;
  dataSyncBarrier();
}

bool VprSharedTransportStream::restartAfterHibernateReset(uint32_t spinLimit) {
  configureTransportMpcWindows();
  volatile Nrf54l15VprTransportVprShared* state = vprShared();
  // Datasheet hibernate semantics are "restart by a reset". Use the same
  // conservative loaded-image restart path that already works cross-board, but
  // keep the retained host-side hibernate state intact so the VPR service can
  // rebuild its runtime state on boot.
  stop();
  delay(10);
  VprControl::clearBufferedSignals();
  VprControl::clearDebugHaltState();
  VprControl::clearCache();
  invalidateCpuSystemCache();
  // The service-level retained restart uses host-retained transport state,
  // not raw VPR CPU register restore. Disable hardware context restore before
  // restarting so the reboot path is deterministic across boards.
  (void)VprControl::enableContextRestore(false);
  state->status = NRF54L15_VPR_TRANSPORT_STATUS_BOOTING;
  state->vprFlags = 0U;
  state->vprLen = 0U;
  state->lastError = 0U;
  dataSyncBarrier();
  (void)VprControl::clearEvent(kTransportEvent);
  if (bootLoadedFirmware() && waitReady(spinLimit)) {
    return true;
  }

  for (uint8_t attempt = 0U; attempt < 2U; ++attempt) {
    const uint32_t previousHeartbeat = state->heartbeat;
    uint32_t notRunningSpins = 0U;
    state->status = NRF54L15_VPR_TRANSPORT_STATUS_BOOTING;
    state->vprFlags = 0U;
    state->vprLen = 0U;
    dataSyncBarrier();
    (void)VprControl::clearEvent(kTransportEvent);
    if (!VprControl::restartAfterHibernateReset()) {
      return false;
    }
    uint32_t waitBudget = spinLimit;
    uint32_t pollCount = 0U;
    invalidateCpuSystemCache();
    while (waitBudget-- > 0U) {
      (void)VprControl::pollEvent(kTransportEvent);
      if ((pollCount++ & 0x3FFFU) == 0U) {
        invalidateCpuSystemCache();
      }
      if (state->magic == NRF54L15_VPR_TRANSPORT_MAGIC &&
          state->version == NRF54L15_VPR_TRANSPORT_VERSION &&
          state->status == NRF54L15_VPR_TRANSPORT_STATUS_READY &&
          state->heartbeat != previousHeartbeat) {
        return true;
      }
      if (state->status == NRF54L15_VPR_TRANSPORT_STATUS_ERROR) {
        break;
      }
      if (!VprControl::isRunning()) {
        if (++notRunningSpins > 4096U) {
          break;
        }
      } else {
        notRunningSpins = 0U;
      }
    }
    delay(10);
  }

  const uint32_t previousHeartbeat = state->heartbeat;
  uint32_t notRunningSpins = 0U;
  stop();
  delay(10);
  VprControl::clearBufferedSignals();
  VprControl::clearDebugHaltState();
  VprControl::clearCache();
  invalidateCpuSystemCache();
  state->status = NRF54L15_VPR_TRANSPORT_STATUS_BOOTING;
  state->vprFlags = 0U;
  state->vprLen = 0U;
  state->lastError = 0U;
  dataSyncBarrier();
  (void)VprControl::clearEvent(kTransportEvent);
  if (!bootLoadedFirmware()) {
    return false;
  }
  uint32_t waitBudget = spinLimit;
  uint32_t pollCount = 0U;
  invalidateCpuSystemCache();
  while (waitBudget-- > 0U) {
    (void)VprControl::pollEvent(kTransportEvent);
    if ((pollCount++ & 0x3FFFU) == 0U) {
      invalidateCpuSystemCache();
    }
    if (state->magic == NRF54L15_VPR_TRANSPORT_MAGIC &&
        state->version == NRF54L15_VPR_TRANSPORT_VERSION &&
        state->status == NRF54L15_VPR_TRANSPORT_STATUS_READY &&
        state->heartbeat != previousHeartbeat) {
      return true;
    }
    if (state->status == NRF54L15_VPR_TRANSPORT_STATUS_ERROR) {
      return false;
    }
    if (!VprControl::isRunning()) {
      if (++notRunningSpins > 4096U) {
        return false;
      }
    } else {
      notRunningSpins = 0U;
    }
  }
  return false;
}

bool VprSharedTransportStream::recoverAfterHibernateFailure(bool clearScripts,
                                                            uint32_t spinLimit) {
  clearRetainedHibernateState();
  (void)VprControl::clearSavedContext();
  (void)VprControl::enableContextRestore(false);
  return restartLoadedFirmware(clearScripts, spinLimit);
}

void VprSharedTransportStream::stop() {
  VprControl::stop();
  vprShared()->status = NRF54L15_VPR_TRANSPORT_STATUS_STOPPED;
  dataSyncBarrier();
  rxLen_ = 0U;
  rxIndex_ = 0U;
}

bool VprSharedTransportStream::waitReady(uint32_t spinLimit) {
  volatile Nrf54l15VprTransportVprShared* state = vprShared();
  uint32_t pollCount = 0U;
  uint32_t notRunningSpins = 0U;
  invalidateCpuSystemCache();
  while (spinLimit-- > 0U) {
    (void)VprControl::pollEvent(kTransportEvent);
    if ((pollCount++ & 0x3FFFU) == 0U) {
      invalidateCpuSystemCache();
    }
    if (state->magic == NRF54L15_VPR_TRANSPORT_MAGIC &&
        state->version == NRF54L15_VPR_TRANSPORT_VERSION &&
        state->status == NRF54L15_VPR_TRANSPORT_STATUS_READY) {
      return true;
    }
    if (state->status == NRF54L15_VPR_TRANSPORT_STATUS_ERROR) {
      return false;
    }
    if (!VprControl::isRunning()) {
      if (++notRunningSpins > 4096U) {
        return false;
      }
    } else {
      notRunningSpins = 0U;
    }
  }
  return false;
}

bool VprSharedTransportStream::pullResponse() {
  invalidateCpuSystemCache();
  volatile Nrf54l15VprTransportVprShared* state = vprShared();
  if ((state->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) == 0U) {
    (void)VprControl::pollEvent(kTransportEvent);
    invalidateCpuSystemCache();
    if ((state->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) == 0U) {
      return false;
    }
  }
  const size_t copyLen = (state->vprLen <= sizeof(rxBuffer_)) ? state->vprLen : sizeof(rxBuffer_);
  memcpy(rxBuffer_, reinterpret_cast<const void*>(const_cast<const uint8_t*>(state->vprData)), copyLen);
  rxLen_ = copyLen;
  rxIndex_ = 0U;
  state->vprFlags = 0U;
  state->vprLen = 0U;
  dataSyncBarrier();
  return copyLen > 0U;
}

