lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_vpr.cpp
bool VprSharedTransportStream::poll() {
  if (rxIndex_ < rxLen_) {
    return true;
  }
  invalidateCpuSystemCache();
  return pullResponse();
}

uint32_t VprSharedTransportStream::heartbeat() const {
  invalidateCpuSystemCache();
  return vprShared()->heartbeat;
}

uint16_t VprSharedTransportStream::lastOpcode() const {
  invalidateCpuSystemCache();
  return static_cast<uint16_t>(vprShared()->lastOpcode & 0xFFFFU);
}

uint32_t VprSharedTransportStream::transportStatus() const {
  invalidateCpuSystemCache();
  return vprShared()->status;
}

uint32_t VprSharedTransportStream::lastError() const {
  invalidateCpuSystemCache();
  return vprShared()->lastError;
}

uint32_t VprSharedTransportStream::reservedState() const {
  invalidateCpuSystemCache();
  return vprShared()->reserved;
}

uint32_t VprSharedTransportStream::reservedAuxState() const {
  invalidateCpuSystemCache();
  return vprShared()->reservedAux;
}

uint32_t VprSharedTransportStream::reservedMetaState() const {
  invalidateCpuSystemCache();
  return vprShared()->reservedMeta;
}

uint32_t VprSharedTransportStream::initPc() const { return VprControl::initPc(); }

bool VprSharedTransportStream::isRunning() const { return VprControl::isRunning(); }

bool VprSharedTransportStream::secureAccessEnabled() const {
  return VprControl::secureAccessEnabled();
}

uint32_t VprSharedTransportStream::spuPerm() const { return VprControl::spuPerm(); }

uint32_t VprSharedTransportStream::debugStatus() const { return VprControl::debugStatus(); }

uint32_t VprSharedTransportStream::haltSummary0() const { return VprControl::haltSummary0(); }

uint32_t VprSharedTransportStream::haltSummary1() const { return VprControl::haltSummary1(); }

uint32_t VprSharedTransportStream::rawNordicTasks() const { return VprControl::rawNordicTasks(); }

uint32_t VprSharedTransportStream::rawNordicEvents() const { return VprControl::rawNordicEvents(); }

uint32_t VprSharedTransportStream::rawNordicEventStatus() const {
  return VprControl::rawNordicEventStatus();
}

uint32_t VprSharedTransportStream::rawSleepControl() const {
  return VprControl::rawSleepControl();
}

uint32_t VprSharedTransportStream::rawNordicCacheCtrl() const {
  return VprControl::rawNordicCacheCtrl();
}

uint32_t VprSharedTransportStream::rawMpcMemAccErrEvent() const {
  return VprControl::rawMpcMemAccErrEvent();
}

uint32_t VprSharedTransportStream::rawMpcMemAccErrAddress() const {
  return VprControl::rawMpcMemAccErrAddress();
}

uint32_t VprSharedTransportStream::rawMpcMemAccErrInfo() const {
  return VprControl::rawMpcMemAccErrInfo();
}

int VprSharedTransportStream::available() {
  (void)poll();
  return static_cast<int>((rxIndex_ < rxLen_) ? (rxLen_ - rxIndex_) : 0U);
}

int VprSharedTransportStream::read() {
  if (available() <= 0) {
    return -1;
  }
  return rxBuffer_[rxIndex_++];
}

int VprSharedTransportStream::peek() {
  if (available() <= 0) {
    return -1;
  }
  return rxBuffer_[rxIndex_];
}

void VprSharedTransportStream::flush() {}

size_t VprSharedTransportStream::write(uint8_t byte) { return write(&byte, 1U); }

size_t VprSharedTransportStream::write(const uint8_t* buffer, size_t len) {
  return writeInternal(buffer, len, false);
}

size_t VprSharedTransportStream::writeWakeRequest(const uint8_t* buffer, size_t len) {
  // True hibernate on nRF54L15 is restart-by-reset, not wake-by-command.
  // Keep the compatibility entry point, but treat hibernated transport as
  // non-writable and require the explicit reset-based restart path instead.
  return writeInternal(buffer, len, false);
}

size_t VprSharedTransportStream::writeInternal(const uint8_t* buffer,
                                               size_t len,
                                               bool allowDormantWake) {
  if (buffer == nullptr || len == 0U || len > NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA) {
    return 0U;
  }
  invalidateCpuSystemCache();
  volatile Nrf54l15VprTransportHostShared* host = hostShared();
  volatile Nrf54l15VprTransportVprShared* vpr = vprShared();
  (void)allowDormantWake;
  if ((vpr->status != NRF54L15_VPR_TRANSPORT_STATUS_READY) ||
      (host->hostFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      (vpr->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      rxIndex_ < rxLen_) {
    return 0U;
  }
  (void)VprControl::clearEvent(kTransportEvent);
  memcpy(reinterpret_cast<void*>(const_cast<uint8_t*>(host->hostData)), buffer, len);
  host->hostLen = static_cast<uint32_t>(len);
  ++host->hostSeq;
  host->hostFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  dataSyncBarrier();
  if (!VprControl::triggerTask(kTransportTask)) {
    host->hostFlags = 0U;
    host->hostLen = 0U;
    dataSyncBarrier();
    return 0U;
  }
  return len;
}

VprControllerServiceHost::VprControllerServiceHost(VprSharedTransportStream* transport)
    : transport_(transport),
      pendingH4Events_{},
      pendingH4EventLens_{},
      pendingH4EventHead_(0U),
      pendingH4EventTail_(0U),
      pendingH4EventCount_(0U),
      pendingH4EventDropped_(0U),
      pendingTickerEvents_{},
      pendingTickerEventHead_(0U),
      pendingTickerEventTail_(0U),
      pendingTickerEventCount_(0U),
      pendingTickerEventDropped_(0U) {}

void VprControllerServiceHost::attach(VprSharedTransportStream* transport) {
  transport_ = transport;
  clearPendingEvents();
}

void VprControllerServiceHost::clearPendingEvents() {
  memset(pendingH4Events_, 0, sizeof(pendingH4Events_));
  memset(pendingH4EventLens_, 0, sizeof(pendingH4EventLens_));
  pendingH4EventHead_ = 0U;
  pendingH4EventTail_ = 0U;
  pendingH4EventCount_ = 0U;
  pendingH4EventDropped_ = 0U;
  memset(pendingTickerEvents_, 0, sizeof(pendingTickerEvents_));
  pendingTickerEventHead_ = 0U;
  pendingTickerEventTail_ = 0U;
  pendingTickerEventCount_ = 0U;
  pendingTickerEventDropped_ = 0U;
}

bool VprControllerServiceHost::attached() const { return transport_ != nullptr; }

bool VprControllerServiceHost::bootDefaultService(bool rebootTransport) {
  if (!attached()) {
    return false;
  }
  clearPendingEvents();
  if (rebootTransport) {
    transport_->stop();
    delay(10);
    if (!transport_->resetSharedState() || !transport_->loadDefaultCsTransportStub()) {
      return false;
    }
  }
  return transport_->isRunning();
}

bool VprControllerServiceHost::restartLoadedService(bool clearScripts) {
  clearPendingEvents();
  return attached() && transport_->restartLoadedFirmware(clearScripts);
}

bool VprControllerServiceHost::restartAfterHibernateReset(uint32_t spinLimit) {
  clearPendingEvents();
  return attached() && transport_->restartAfterHibernateReset(spinLimit);
}

