lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_vpr.cpp
bool VprControllerServiceHost::recoverAfterHibernateFailure(bool clearScripts,
                                                            uint32_t spinLimit) {
  if (!attached()) {
    return false;
  }
  if (transport_->recoverAfterHibernateFailure(clearScripts, spinLimit)) {
    return true;
  }

  transport_->clearRetainedHibernateState();
  delay(10);
  return bootDefaultService(true);
}

uint32_t VprControllerServiceHost::readLe32(const uint8_t* data) {
  if (data == nullptr) {
    return 0U;
  }
  return static_cast<uint32_t>(data[0]) |
         (static_cast<uint32_t>(data[1]) << 8U) |
         (static_cast<uint32_t>(data[2]) << 16U) |
         (static_cast<uint32_t>(data[3]) << 24U);
}

bool VprControllerServiceHost::readH4Event(uint8_t* packet,
                                           size_t packetSize,
                                           size_t* packetLen,
                                           uint32_t timeoutMs) {
  if (!attached() || packet == nullptr || packetLen == nullptr || packetSize < 3U) {
    return false;
  }

  *packetLen = 0U;
  const uint32_t start = millis();
  size_t expectedLen = 0U;
  while ((millis() - start) < timeoutMs) {
    while (transport_->available() > 0) {
      const int incoming = transport_->read();
      if (incoming < 0) {
        break;
      }
      if (*packetLen >= packetSize) {
        return false;
      }
      packet[(*packetLen)++] = static_cast<uint8_t>(incoming);
      if (*packetLen == 3U) {
        expectedLen = 3U + packet[2];
        if (expectedLen > packetSize) {
          return false;
        }
      }
      if ((expectedLen != 0U) && (*packetLen >= expectedLen)) {
        return true;
      }
    }
    delay(2);
  }
  return false;
}

bool VprControllerServiceHost::parseCommandComplete(const uint8_t* packet,
                                                    size_t packetLen,
                                                    uint16_t expectedOpcode,
                                                    const uint8_t** payload,
                                                    size_t* payloadLen) {
  if (packet == nullptr || payload == nullptr || payloadLen == nullptr ||
      packetLen < 7U || packet[0] != 0x04U || packet[1] != 0x0EU) {
    return false;
  }
  const size_t paramLen = packet[2];
  if (packetLen != (3U + paramLen) || paramLen < 3U) {
    return false;
  }
  const uint16_t opcode =
      static_cast<uint16_t>(packet[4]) |
      (static_cast<uint16_t>(packet[5]) << 8U);
  if (opcode != expectedOpcode) {
    return false;
  }
  *payload = &packet[6];
  *payloadLen = paramLen - 3U;
  return true;
}

bool VprControllerServiceHost::parseCommandStatus(const uint8_t* packet,
                                                  size_t packetLen,
                                                  uint16_t expectedOpcode,
                                                  const uint8_t** payload,
                                                  size_t* payloadLen) {
  if (packet == nullptr || payload == nullptr || payloadLen == nullptr ||
      packetLen < 7U || packet[0] != 0x04U || packet[1] != 0x0FU) {
    return false;
  }
  const size_t paramLen = packet[2];
  if (packetLen != (3U + paramLen) || paramLen < 4U) {
    return false;
  }
  const uint16_t opcode =
      static_cast<uint16_t>(packet[5]) |
      (static_cast<uint16_t>(packet[6]) << 8U);
  if (opcode != expectedOpcode) {
    return false;
  }
  *payload = &packet[3];
  *payloadLen = paramLen;
  return true;
}

bool VprControllerServiceHost::parseVendorEvent(const uint8_t* packet,
                                                size_t packetLen,
                                                uint8_t expectedSubevent,
                                                const uint8_t** payload,
                                                size_t* payloadLen) {
  if (packet == nullptr || payload == nullptr || payloadLen == nullptr ||
      packetLen < 5U || packet[0] != 0x04U || packet[1] != kVendorEventCode) {
    return false;
  }
  const size_t paramLen = packet[2];
  if (packetLen != (3U + paramLen) || paramLen < 1U || packet[3] != expectedSubevent) {
    return false;
  }
  *payload = &packet[4];
  *payloadLen = paramLen - 1U;
  return true;
}

bool VprControllerServiceHost::pushPendingTickerEvent(const VprTickerEvent& event) {
  if (pendingTickerEventCount_ >= kPendingTickerEventQueueDepth) {
    pendingTickerEventDropped_ += 1U;
    return false;
  }
  pendingTickerEvents_[pendingTickerEventTail_] = event;
  pendingTickerEventTail_ = (pendingTickerEventTail_ + 1U) % kPendingTickerEventQueueDepth;
  pendingTickerEventCount_ += 1U;
  return true;
}

bool VprControllerServiceHost::pushPendingH4Event(const uint8_t* packet, size_t packetLen) {
  if (packet == nullptr || packetLen == 0U || packetLen > kPendingH4EventMaxBytes) {
    pendingH4EventDropped_ += 1U;
    return false;
  }
  if (pendingH4EventCount_ >= kPendingH4EventQueueDepth) {
    pendingH4EventDropped_ += 1U;
    return false;
  }
  memcpy(pendingH4Events_[pendingH4EventTail_], packet, packetLen);
  pendingH4EventLens_[pendingH4EventTail_] = packetLen;
  pendingH4EventTail_ = (pendingH4EventTail_ + 1U) % kPendingH4EventQueueDepth;
  pendingH4EventCount_ += 1U;
  return true;
}

bool VprControllerServiceHost::stashAsyncEvent(const uint8_t* packet, size_t packetLen) {
  bool handled = false;
  if (packet != nullptr && packetLen >= 3U && packet[0] == 0x04U) {
    handled = true;
    (void)pushPendingH4Event(packet, packetLen);
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseVendorEvent(packet, packetLen, kVendorEventTicker, &payload, &payloadLen) ||
      payloadLen < 13U) {
    return handled;
  }
  VprTickerEvent event{};
  event.flags = payload[0];
  event.count = readLe32(&payload[1]);
  event.step = readLe32(&payload[5]);
  event.heartbeat = readLe32(&payload[9]);
  event.sequence = (payloadLen >= 17U) ? readLe32(&payload[13]) : 0U;
  (void)pushPendingTickerEvent(event);
  return true;
}

bool VprControllerServiceHost::popPendingH4Event(uint8_t* packet,
                                                 size_t packetSize,
                                                 size_t* packetLen) {
  if (packetLen != nullptr) {
    *packetLen = 0U;
  }
  if (packet == nullptr || packetLen == nullptr || pendingH4EventCount_ == 0U) {
    return false;
  }

  const size_t copyLen = pendingH4EventLens_[pendingH4EventHead_];
  if (copyLen == 0U || copyLen > packetSize) {
    pendingH4EventDropped_ += 1U;
    memset(pendingH4Events_[pendingH4EventHead_], 0,
           sizeof(pendingH4Events_[pendingH4EventHead_]));
    pendingH4EventLens_[pendingH4EventHead_] = 0U;
    pendingH4EventHead_ = (pendingH4EventHead_ + 1U) % kPendingH4EventQueueDepth;
    pendingH4EventCount_ -= 1U;
    return false;
  }

  memcpy(packet, pendingH4Events_[pendingH4EventHead_], copyLen);
  *packetLen = copyLen;
  memset(pendingH4Events_[pendingH4EventHead_], 0,
         sizeof(pendingH4Events_[pendingH4EventHead_]));
  pendingH4EventLens_[pendingH4EventHead_] = 0U;
  pendingH4EventHead_ = (pendingH4EventHead_ + 1U) % kPendingH4EventQueueDepth;
  pendingH4EventCount_ -= 1U;
  return true;
}

bool VprControllerServiceHost::popPendingTickerEvent(VprTickerEvent* event) {
  if (event == nullptr || pendingTickerEventCount_ == 0U) {
    return false;
  }
  *event = pendingTickerEvents_[pendingTickerEventHead_];
  memset(&pendingTickerEvents_[pendingTickerEventHead_], 0,
         sizeof(pendingTickerEvents_[pendingTickerEventHead_]));
  pendingTickerEventHead_ = (pendingTickerEventHead_ + 1U) % kPendingTickerEventQueueDepth;
  pendingTickerEventCount_ -= 1U;
  return true;
}

bool VprControllerServiceHost::sendHciCommand(uint16_t opcode,
                                              const uint8_t* params,
                                              size_t paramsLen,
                                              uint8_t* response,
                                              size_t responseSize,
                                              size_t* responseLen) {
  if (!attached() || response == nullptr || responseLen == nullptr || paramsLen > 250U) {
    return false;
  }

  uint8_t command[260];
  command[0] = 0x01U;
  command[1] = static_cast<uint8_t>(opcode & 0xFFU);
  command[2] = static_cast<uint8_t>((opcode >> 8U) & 0xFFU);
  command[3] = static_cast<uint8_t>(paramsLen);
  if (paramsLen != 0U && params != nullptr) {
    memcpy(&command[4], params, paramsLen);
  }

