lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_vpr.cpp
  const size_t commandLen = 4U + paramsLen;
  uint8_t packet[kPendingH4EventMaxBytes] = {0};
  size_t packetLen = 0U;
  const uint32_t start = millis();
  bool commandSent = false;
  while ((millis() - start) < 5000UL) {
    const uint32_t elapsed = millis() - start;
    const uint32_t remaining = (elapsed < 5000UL) ? (5000UL - elapsed) : 0U;

    if (!commandSent) {
      const size_t written = transport_->write(command, commandLen);
      if (written == commandLen) {
        commandSent = true;
        continue;
      }
    }

    const uint32_t readBudget = (remaining > 50UL) ? 50UL : remaining;
    if (!readH4Event(packet, sizeof(packet), &packetLen, readBudget)) {
      if (!commandSent) {
        delay(2);
        continue;
      }
      delay(2);
      continue;
    }

    const uint8_t* payload = nullptr;
    size_t payloadLen = 0U;
    if (commandSent &&
        (parseCommandComplete(packet, packetLen, opcode, &payload, &payloadLen) ||
         parseCommandStatus(packet, packetLen, opcode, &payload, &payloadLen))) {
      if (packetLen > responseSize) {
        return false;
      }
      memcpy(response, packet, packetLen);
      *responseLen = packetLen;
      return true;
    }

    if (stashAsyncEvent(packet, packetLen)) {
      continue;
    }
  }
  return false;
}

bool VprControllerServiceHost::ping(uint32_t cookie,
                                    uint32_t* echoedCookie,
                                    uint32_t* heartbeat) {
  uint8_t response[64];
  size_t responseLen = 0U;
  uint8_t params[4] = {
      static_cast<uint8_t>(cookie & 0xFFU),
      static_cast<uint8_t>((cookie >> 8U) & 0xFFU),
      static_cast<uint8_t>((cookie >> 16U) & 0xFFU),
      static_cast<uint8_t>((cookie >> 24U) & 0xFFU),
  };
  if (!sendHciCommand(kVendorPingOpcode, params, sizeof(params), response,
                      sizeof(response), &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorPingOpcode, &payload,
                            &payloadLen) ||
      payloadLen < 9U || payload[0] != 0U) {
    return false;
  }

  if (echoedCookie != nullptr) {
    *echoedCookie = readLe32(&payload[1]);
  }
  if (heartbeat != nullptr) {
    *heartbeat = readLe32(&payload[5]);
  }
  return true;
}

bool VprControllerServiceHost::readTransportInfo(VprControllerServiceInfo* info) {
  if (info == nullptr) {
    return false;
  }
  uint8_t response[64];
  size_t responseLen = 0U;
  if (!sendHciCommand(kVendorInfoOpcode, nullptr, 0U, response, sizeof(response),
                      &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorInfoOpcode, &payload,
                            &payloadLen) ||
      payloadLen < 12U || payload[0] != 0U) {
    return false;
  }

  info->transportStatus = payload[1];
  info->transportError = payload[2];
  info->transportFlags = payload[3];
  info->heartbeat = readLe32(&payload[4]);
  info->scriptCount = readLe32(&payload[8]);
  return true;
}

bool VprControllerServiceHost::readCapabilities(VprControllerServiceCapabilities* caps) {
  if (caps == nullptr) {
    return false;
  }

  uint8_t response[64];
  size_t responseLen = 0U;
  if (!sendHciCommand(kVendorCapabilitiesOpcode, nullptr, 0U, response, sizeof(response),
                      &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorCapabilitiesOpcode, &payload,
                            &payloadLen) ||
      payloadLen < 11U || payload[0] != 0U) {
    return false;
  }

  caps->serviceVersionMajor = payload[1];
  caps->serviceVersionMinor = payload[2];
  caps->opMask = readLe32(&payload[3]);
  caps->maxInputLen = readLe32(&payload[7]);
  return true;
}

bool VprControllerServiceHost::hashFnv1a32(const uint8_t* data,
                                           size_t len,
                                           uint32_t* hash,
                                           uint32_t* processedLen) {
  if (hash == nullptr || len > 124U || (len != 0U && data == nullptr)) {
    return false;
  }

  uint8_t response[64];
  size_t responseLen = 0U;
  if (!sendHciCommand(kVendorFnv1a32Opcode, data, len, response, sizeof(response),
                      &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorFnv1a32Opcode, &payload,
                            &payloadLen) ||
      payloadLen < 9U || payload[0] != 0U) {
    return false;
  }

  *hash = readLe32(&payload[1]);
  if (processedLen != nullptr) {
    *processedLen = readLe32(&payload[5]);
  }
  return true;
}

bool VprControllerServiceHost::crc32(const uint8_t* data,
                                     size_t len,
                                     uint32_t* crc,
                                     uint32_t* processedLen) {
  if (crc == nullptr || len > 124U || (len != 0U && data == nullptr)) {
    return false;
  }

  uint8_t response[64];
  size_t responseLen = 0U;
  if (!sendHciCommand(kVendorCrc32Opcode, data, len, response, sizeof(response),
                      &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorCrc32Opcode, &payload,
                            &payloadLen) ||
      payloadLen < 9U || payload[0] != 0U) {
    return false;
  }

  *crc = readLe32(&payload[1]);
  if (processedLen != nullptr) {
    *processedLen = readLe32(&payload[5]);
  }
  return true;
}

bool VprControllerServiceHost::crc32c(const uint8_t* data,
                                      size_t len,
                                      uint32_t* crc,
                                      uint32_t* processedLen) {
  if (crc == nullptr || len > 124U || (len != 0U && data == nullptr)) {
    return false;
  }

  uint8_t response[64];
  size_t responseLen = 0U;
  if (!sendHciCommand(kVendorCrc32cOpcode, data, len, response, sizeof(response),
                      &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorCrc32cOpcode, &payload,
                            &payloadLen) ||
      payloadLen < 9U || payload[0] != 0U) {
    return false;
  }

  *crc = readLe32(&payload[1]);
  if (processedLen != nullptr) {
    *processedLen = readLe32(&payload[5]);
  }
  return true;
}

