lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_vpr.cpp
bool VprControllerServiceHost::configureTicker(bool enabled,
                                               uint32_t periodTicks,
                                               uint32_t step,
                                               VprTickerState* state) {
  uint8_t params[9] = {
      static_cast<uint8_t>(enabled ? 1U : 0U),
      static_cast<uint8_t>(periodTicks & 0xFFU),
      static_cast<uint8_t>((periodTicks >> 8U) & 0xFFU),
      static_cast<uint8_t>((periodTicks >> 16U) & 0xFFU),
      static_cast<uint8_t>((periodTicks >> 24U) & 0xFFU),
      static_cast<uint8_t>(step & 0xFFU),
      static_cast<uint8_t>((step >> 8U) & 0xFFU),
      static_cast<uint8_t>((step >> 16U) & 0xFFU),
      static_cast<uint8_t>((step >> 24U) & 0xFFU),
  };
  uint8_t response[64];
  size_t responseLen = 0U;
  if (!sendHciCommand(kVendorTickerConfigureOpcode, params, sizeof(params), response,
                      sizeof(response), &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorTickerConfigureOpcode, &payload,
                            &payloadLen) ||
      payloadLen < 14U || payload[0] != 0U) {
    return false;
  }

  if (state != nullptr) {
    state->enabled = payload[1] != 0U;
    state->periodTicks = readLe32(&payload[2]);
    state->step = readLe32(&payload[6]);
    state->count = readLe32(&payload[10]);
  }
  return true;
}

bool VprControllerServiceHost::readTickerState(VprTickerState* state) {
  if (state == nullptr) {
    return false;
  }
  uint8_t response[64];
  size_t responseLen = 0U;
  if (!sendHciCommand(kVendorTickerReadStateOpcode, nullptr, 0U, response, sizeof(response),
                      &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorTickerReadStateOpcode, &payload,
                            &payloadLen) ||
      payloadLen < 14U || payload[0] != 0U) {
    return false;
  }

  state->enabled = payload[1] != 0U;
  state->periodTicks = readLe32(&payload[2]);
  state->step = readLe32(&payload[6]);
  state->count = readLe32(&payload[10]);
  return true;
}

bool VprControllerServiceHost::configureTickerEvents(bool enabled,
                                                     uint32_t emitEveryCount,
                                                     uint32_t* appliedEmitEveryCount,
                                                     uint32_t* droppedEvents) {
  uint8_t params[5] = {
      static_cast<uint8_t>(enabled ? 1U : 0U),
      static_cast<uint8_t>(emitEveryCount & 0xFFU),
      static_cast<uint8_t>((emitEveryCount >> 8U) & 0xFFU),
      static_cast<uint8_t>((emitEveryCount >> 16U) & 0xFFU),
      static_cast<uint8_t>((emitEveryCount >> 24U) & 0xFFU),
  };
  uint8_t response[64];
  size_t responseLen = 0U;
  if (!sendHciCommand(kVendorTickerEventConfigureOpcode, params, sizeof(params), response,
                      sizeof(response), &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorTickerEventConfigureOpcode,
                            &payload, &payloadLen) ||
      payloadLen < 14U || payload[0] != 0U) {
    return false;
  }

  if (appliedEmitEveryCount != nullptr) {
    *appliedEmitEveryCount = readLe32(&payload[2]);
  }
  if (droppedEvents != nullptr) {
    *droppedEvents = readLe32(&payload[10]);
  }
  return payload[1] == (enabled ? 1U : 0U);
}

bool VprControllerServiceHost::waitTickerEvent(VprTickerEvent* event, uint32_t timeoutMs) {
  if (event == nullptr || !attached()) {
    return false;
  }
  if (popPendingTickerEvent(event)) {
    return true;
  }

  uint8_t packet[64];
  size_t packetLen = 0U;
  const uint32_t start = millis();
  while ((millis() - start) < timeoutMs) {
    const uint32_t elapsed = millis() - start;
    const uint32_t remaining = (elapsed < timeoutMs) ? (timeoutMs - elapsed) : 0U;
    if (!readH4Event(packet, sizeof(packet), &packetLen, remaining)) {
      return false;
    }
    if (stashAsyncEvent(packet, packetLen) && popPendingTickerEvent(event)) {
      return true;
    }
  }
  return false;
}

uint32_t VprControllerServiceHost::pendingH4EventDropCount() const {
  return pendingH4EventDropped_;
}

uint32_t VprControllerServiceHost::pendingTickerEventDropCount() const {
  return pendingTickerEventDropped_;
}

bool VprControllerServiceHost::enterHibernate() {
  uint8_t response[32];
  size_t responseLen = 0U;
  if (!sendHciCommand(kVendorEnterHibernateOpcode, nullptr, 0U, response, sizeof(response),
                      &responseLen)) {
    return false;
  }

  const uint8_t* payload = nullptr;
  size_t payloadLen = 0U;
  if (!parseCommandComplete(response, responseLen, kVendorEnterHibernateOpcode, &payload,
                            &payloadLen) ||
      payloadLen < 1U || payload[0] != 0U) {
    return false;
  }
  return true;
}

bool VprControllerServiceHost::probe(uint32_t cookie,
                                     VprControllerServiceInfo* info,
                                     uint32_t* echoedCookie,
                                     uint32_t* heartbeat) {
  uint32_t echoed = 0U;
  uint32_t hb = 0U;
  if (!ping(cookie, &echoed, &hb) || echoed != cookie) {
    return false;
  }
  if (echoedCookie != nullptr) {
    *echoedCookie = echoed;
  }
  if (heartbeat != nullptr) {
    *heartbeat = hb;
  }
  return (info == nullptr) ? true : readTransportInfo(info);
}

}  // namespace xiao_nrf54l15
